In [85]:
import pandas as pd

In [86]:
y=pd.Period('2024')

In [87]:
y

Period('2024', 'A-DEC')

In [88]:
y.start_time

Timestamp('2024-01-01 00:00:00')

In [89]:
y.end_time

Timestamp('2024-12-31 23:59:59.999999999')

In [90]:
m=pd.Period('2024-01','M')
m

Period('2024-01', 'M')

In [91]:
m.start_time

Timestamp('2024-01-01 00:00:00')

In [92]:
m.end_time

Timestamp('2024-01-31 23:59:59.999999999')

In [93]:
m+1

Period('2024-02', 'M')

In [94]:
d=pd.Period('2024-03-23','D')

In [95]:
d.start_time

Timestamp('2024-03-23 00:00:00')

In [96]:
d.end_time

Timestamp('2024-03-23 23:59:59.999999999')

In [97]:
d+5

Period('2024-03-28', 'D')

In [98]:
q=pd.Period('2024','Q')

In [99]:
q.start_time

Timestamp('2024-01-01 00:00:00')

In [100]:
q.end_time

Timestamp('2024-03-31 23:59:59.999999999')

In [101]:
inx=pd.period_range('2023','2024',freq='Q')
inx

PeriodIndex(['2023Q1', '2023Q2', '2023Q3', '2023Q4', '2024Q1'], dtype='period[Q-DEC]')

In [102]:
inx[0].start_time

Timestamp('2023-01-01 00:00:00')

In [103]:
inx[0].end_time

Timestamp('2023-03-31 23:59:59.999999999')

In [104]:
ndf=pd.read_csv("wmt.csv")
ndf

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [105]:
ndf.set_index('Line Item',inplace=True)

In [106]:
ndf

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [107]:
ndf=ndf.T

In [108]:
ndf.index

Index(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [109]:
ndf.index = pd.PeriodIndex(ndf.index, freq='Q-JAN')
ndf.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [110]:
ndf

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [111]:
ndf['Start_Date']=ndf.index.map(lambda x: x.start_time)
ndf

Line Item  Revenue  Expenses  Profit Start_Date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [112]:
ndf['End_Date']=ndf.index.map(lambda x: x.end_time.date)
ndf

Line Item  Revenue  Expenses  Profit Start_Date    End_Date
2017Q1      115904     86544   29360 2016-02-01  2016-04-30
2017Q2      120854     89485   31369 2016-05-01  2016-07-31
2017Q3      118179     87484   30695 2016-08-01  2016-10-31
2017Q4      130936     97743   33193 2016-11-01  2017-01-31
2018Q1      117542     87688   29854 2017-02-01  2017-04-30

In [113]:
ndf.columns

Index(['Revenue', 'Expenses', 'Profit', 'Start_Date', 'End_Date'], dtype='object', name='Line Item')

In [114]:
ndf=ndf[['Start_Date', 'End_Date','Revenue', 'Expenses', 'Profit']]

In [115]:
ndf

Line Item Start_Date    End_Date  Revenue  Expenses  Profit
2017Q1    2016-02-01  2016-04-30   115904     86544   29360
2017Q2    2016-05-01  2016-07-31   120854     89485   31369
2017Q3    2016-08-01  2016-10-31   118179     87484   30695
2017Q4    2016-11-01  2017-01-31   130936     97743   33193
2018Q1    2017-02-01  2017-04-30   117542     87688   29854